# LIMPIEZA IV 21/8

In [1]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import numpy as np

1. Lo primero que tenemos que evaluar es en que columnas tenemos nulos y que cantidad tenemos en cada una. ¿Hay alguna columna con una gran cantidad de nulos? En caso de que sea así deberemos eliminarla.

In [2]:
df = pd.read_csv("data/pair3_bank_additional_full.csv", index_col = 0)

In [3]:
df.head(5)

,index,age,job,marital,education,default,housing,loan,contact,duration,...,"cons,conf,idx",euribor3m,"nr,employed",y,month_day_week,loan_modificado,housing_modificado,default_modificado,month,day
0,0,56.0,housemaid,married,NaN,0.0,0.0,0.0,telephone,261,...,-36.4,4.857,5191.0,no,"['may', 'mon']",sí,sí,sí,may,mon
1,1,NaN,services,married,NaN,NaN,0.0,NaN,telephone,149,...,-36.4,4.857,5191.0,no,"['may', 'mon']",NaN,sí,NaN,may,mon
2,2,37.0,services,married,high school,0.0,1.0,0.0,telephone,226,...,-36.4,4.857,5191.0,NaN,"['may', 'mon']",sí,no,sí,may,mon
3,3,40.0,NaN,married,basic 6y,0.0,0.0,0.0,telephone,151,...,-36.4,4.857,5191.0,no,"['may', 'mon']",sí,sí,sí,may,mon
4,4,56.0,services,NaN,NaN,0.0,0.0,0.0,telephone,307,...,-36.4,4.857,5191.0,no,"['may', 'mon']",no,sí,sí,may,mon

In [4]:
nulos = pd.DataFrame((df.isnull().sum() * 100) / df.shape[0]).reset_index()
nulos.columns = ["columna", "porcentaje"]
nulos

               columna  porcentaje
0                index    0.000000
1                  age   10.445297
2                  job   11.146992
3              marital   19.916962
4            education   33.853737
5              default   20.873598
6              housing    2.403729
7                 loan   21.711261
8              contact    0.000000
9             duration    0.000000
10            campaign    1.048900
11               pdays    0.000000
12            previous    0.000000
13            poutcome    0.000000
14        emp,var,rate   31.008110
15      cons,price,idx   10.440441
16       cons,conf,idx    0.000000
17           euribor3m    0.000000
18         nr,employed    0.000000
19                   y   30.959549
20      month_day_week    0.000000
21     loan_modificado   21.711261
22  housing_modificado    2.403729
23  default_modificado   20.873598
24               month    0.000000
25                 day    0.000000

2. Es el momento de eliminar los nulos:
- Reemplazad los valores nulos de las columnas age y campaign por la media, redondeada a dos decimales.

In [5]:
df["age"].isnull().sum()

4302

In [6]:
df['age'].fillna(round(df['age'].mean(),2), inplace = True)

In [7]:
df['age']

0        56.00
1        39.56
2        37.00
3        40.00
4        56.00
         ...
41181    38.00
41182    46.00
41183    56.00
41184    44.00
41185    38.00
Name: age, Length: 41186, dtype: float64

In [8]:
df['age'].isnull().sum()

0

In [9]:
df["campaign"].isnull().sum()

432

In [10]:
df['campaign'].fillna(round(df['campaign'].mean(),2), inplace = True)

In [11]:
df['campaign']

0        1.0
1        1.0
2        1.0
3        1.0
4        1.0
        ...
41181    1.0
41182    1.0
41183    2.0
41184    1.0
41185    3.0
Name: campaign, Length: 41186, dtype: float64

In [12]:
df["campaign"].isnull().sum()

0

- Reemplazad los valores nulos de la columna emp.var.rate y cons.price.idx por la mediana de cada una de estas columnas, redondeada a dos decimales.

In [13]:
df["emp,var,rate"].isnull().sum()

12771

In [14]:
df['emp,var,rate'].fillna(round(df['emp,var,rate'].median(),2), inplace = True)

In [15]:
df["emp,var,rate"].isnull().sum()

0

In [16]:
df["cons,price,idx"].isnull().sum()

4300

In [17]:
df['cons,price,idx'].fillna(round(df['cons,price,idx'].median(),2), inplace = True)

In [18]:
df["cons,price,idx"].isnull().sum()

0

- En relación a las columnas de education, default, housing y loan al tratarse de columnas de tipo categórica, reemplazad los valores nulos por una nueva categória que se llame unknown.

In [19]:
df["education"].replace(np.nan, "Unknow", inplace = True)

In [20]:
df_education = df[df["education"] == "Unknow"]
df_education["education"].head()

0    Unknow
1    Unknow
4    Unknow
7    Unknow
8    Unknow
Name: education, dtype: object

In [21]:
df["default"].replace(np.nan, "Unknow", inplace = True)

In [22]:
df_default = df[df["default"] == "Unknow"]
df_default["default"].head()

1     Unknow
5     Unknow
7     Unknow
10    Unknow
15    Unknow
Name: default, dtype: object

In [23]:
df["housing"].replace(np.nan, "Unknow", inplace = True)

In [24]:
df_housing = df[df["housing"] == "Unknow"]
df_housing["housing"].head()

29     Unknow
81     Unknow
261    Unknow
385    Unknow
401    Unknow
Name: housing, dtype: object

In [25]:
df["loan"].replace(np.nan, "Unknow", inplace = True)

In [26]:
df_loan = df[df["loan"] == "Unknow"]
df_loan["loan"].head()

1     Unknow
13    Unknow
15    Unknow
24    Unknow
28    Unknow
Name: loan, dtype: object

- Reemplazad los valores nulos de las columna job y marital por el valor más frecuente (la moda).

In [27]:
df["job"].isnull().sum()

4591

In [28]:
df["job"].mode()

0    administrator
Name: job, dtype: object

In [29]:
df["job"].fillna(df["job"].mode(), inplace = True)

In [30]:
df["job"].isnull().sum()

4591

In [31]:
df["marital"].isnull().sum()

8203

In [32]:
df['marital'].mode()

0    married
Name: marital, dtype: object

In [33]:
df["marital"].replace(np.nan,df["marital"].mode()[0], inplace = True)

In [34]:
df["marital"].isnull().sum()

0

- Nos quedan la columna y. ¿Qué tipo de variable es? Decidid cual sería la mejor gestión de nulos para esta columna.

In [35]:
df["y"].dtypes

dtype('O')

In [36]:
df["y"].unique()

array(['no', nan, 'yes'], dtype=object)

In [37]:
df["y"].isnull().sum()

12751

La columna "y" es una variable de tipo categórica. Tras aplicar el método "unique" constatamos que existen como valor solamente tres resultados: "yes", "no" y nan. Por este motivo, reemplazaría el valor nulo por un nuevo valor llamado "unknown" para catalogar a esas respuestas que no son ni "yes" ni "no" en una nueva categoría. Para ello aplicaríamos:
df["y"].replace(np.nan, "Unknow", inplace = True)

3. Guardad el csv.

In [38]:
df.to_csv("data/pair4_bank_additional_full.csv")